In [64]:
import pandas as pd
pd.Series(['MINAS GERAIS', 'RIO DE JANEIRO', 'SÃO PAULO'])

0      MINAS GERAIS
1    RIO DE JANEIRO
2         SÃO PAULO
dtype: object

In [65]:
pd.Series(['Fiat', 'Jeep', 'Volvo'])

0     Fiat
1     Jeep
2    Volvo
dtype: object

In [66]:
carros=pd.DataFrame({
    'ESTADO': ['MINAS GERAIS', 'RIO DE JANEIRO', 'SÃO PAULO'],
    'MARCA': ['Fiat', 'Jeep', 'Volvo']
})

In [67]:
carros

           ESTADO  MARCA
0    MINAS GERAIS   Fiat
1  RIO DE JANEIRO   Jeep
2       SÃO PAULO  Volvo

In [68]:
venda_de_carros = pd.read_csv('/home/youx/youxlab-treino-git/Dados/Exercícios/datasets/venda-de-carros.csv')

In [99]:
venda_de_carros

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

In [70]:
type(venda_de_carros)

pandas.core.frame.DataFrame

In [71]:
type(carros)

pandas.core.frame.DataFrame

In [72]:
venda_de_carros.describe()

       Quilometragem     Portas
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [73]:
venda_de_carros.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Fabricante     10 non-null     object
 1   Cor            10 non-null     object
 2   Quilometragem  10 non-null     int64
 3   Portas         10 non-null     int64
 4   Preco          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [74]:
venda_de_carros.columns

Index(['Fabricante', 'Cor', 'Quilometragem', 'Portas', 'Preco'], dtype='object')

In [75]:
venda_de_carros.head()

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00

In [76]:
venda_de_carros.tail()
#tail()--> mostra as últimas 5 linhas por padrão

  Fabricante     Cor  Quilometragem  Portas         Preco
5     Toyota   Verde          99213       4  R$ 14,500.00
6      Honda    Azul          45698       4  R$ 17,500.00
7      Honda    Azul          54738       4  R$ 27,000.00
8     Toyota  Branco          60000       4  R$ 26,250.00
9     Nissan  Branco          31600       4  R$ 19,700.00

In [77]:
venda_de_carros.loc[3]

Fabricante                 BMW
Cor                      Preto
Quilometragem            11179
Portas                       5
Preco            R$ 122,000.00
Name: 3, dtype: object

In [78]:
venda_de_carros.iloc[4]

Fabricante             Nissan
Cor                    Branco
Quilometragem          213095
Portas                      4
Preco            R$ 13,500.00
Name: 4, dtype: object

In [79]:
venda_de_carros['Quilometragem']

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Quilometragem, dtype: int64

In [80]:
media_km=venda_de_carros['Quilometragem'].mean()
media_km

np.float64(78601.4)

In [81]:
selecao= venda_de_carros['Quilometragem']>100000

In [82]:
venda_de_carros[selecao]

  Fabricante     Cor  Quilometragem  Portas         Preco
0     Toyota  Branco         150043       4  R$ 24,000.00
4     Nissan  Branco         213095       4  R$ 13,500.00

In [83]:
agrupado_fabricante= venda_de_carros.groupby('Fabricante')

In [89]:
agrupado_fabricante

In [91]:
venda_de_carros.head()

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00

In [93]:
media_colunas = venda_de_carros.groupby('Fabricante')['Quilometragem'].mean()
media_colunas

Fabricante
BMW        11179.000000
Honda      62778.333333
Nissan    122347.500000
Toyota     85451.250000
Name: Quilometragem, dtype: float64

In [98]:
media_colunas=  venda_de_carros.groupby('Fabricante')['Portas'].mean()
media_colunas

Fabricante
BMW       5.00
Honda     4.00
Nissan    4.00
Toyota    3.75
Name: Portas, dtype: float64